Repository: 1x-eng/sqitch
Catalog: po/*.po
Languages: fr

source: User name may not contain "<" or start with "["
fr: Le nom d'utilisateur ne peut contenir "<" ou commençant par "["

source: User email may not contain ">"
fr: L'email utilisateur ne peut contenir ">"

source: Unknown engine: {engine}
fr: Moteur inconnu : {engine}

source: No engine specified; use --engine or set core.engine
fr: Pas de moteur spécifié; utiliser --engine ou définir core.engine

source: Cannot find your name; run sqitch config --user user.name "YOUR NAME"
fr: Impossible de trouver votre nom; exécuter sqitch config --user user.name "VOTRE NOM"

source: Cannot infer your email address; run sqitch config --user user.email you@host.com
fr: Impossible de déduire votre adressse email; exécuter sqitch config --user user.email vous@hote.com

source: Cannot exec {command}: {error}
fr: Impossible d'exécuter {command} : {error}

source: Error closing pipe to {command}: {error}
fr: Erreur en fermant le tube vers {command} : {error}

source: {command} unexpectedly returned exit value {exitval}
fr: {command} a retourné de manière inattendue la valeur {exitval}

source: "{command}" is not a valid command
fr: "{command}" n'est pas une commande valide

source: Could not determine home directory
fr: Impossible de déterminer le répertoire de référence

source: Unknown date format "{format}"
fr: Format de date inconnu "{format}"

source: Nothing to deploy (empty plan)
fr: Rien à déployer (plan vide)

source: Unknown deploy target: "{target}"
fr: Cible de déploiement inconnue : "{target}"

source: Nothing to deploy (already at "{target}"
fr: Rien à déployer (déjà sur "{target}"

source: Nothing to deploy (up-to-date)
fr: Rien à déployer (à jour)

source: Adding metadata tables to {destination}
fr: Ajout des tables de metadonnées à {destination}

source: Cannot deploy to an earlier target; use "revert" instead
fr: Impossible de déployer vers une cible antérieure; utiliser "revert" plutôt

source: Deploying changes through {target} to {destination}
fr: Déploiement des changements de {target} à {destination}

source: Deploying changes to {destination}
fr: Déploiement des changements vers {destination}

source: Unknown deployment mode: "{mode}"
fr: Mode de déploiement inconnu : "{mode}"

source: Target not deployed: "{target}"
fr: Cible non déployée : "{target}"

source: Unknown revert target: "{target}"
fr: Cible d'annulation inconnue : "{target}"

source: Reverting changes to {target} from {destination}
fr: Annulation des changements de {destination} à {target}

source: Nothing to revert (nothing deployed)
fr: Rien à annuler (rien de déployé)

source: Reverting all changes from {destination}
fr: Annulation de tous les changements de {destination}

source: Invalid dependency: {dependency}
fr: Dépendance invalide {dependency}

source: Reverting to {target}
fr: Annulation et retour vers {target}

source: Reverting all changes
fr: Annulation de tous les changements

source: The schema will need to be manually repaired
fr: Le schéma devra être réparé manuellement

source: Deploy failed
fr: Echec du déploiement

source: Conflicts with previously deployed change: {changes}
fr: Conflits avec le changement déployé précédemment : {changes}

source: Missing required change: {changes}
fr: Changement requis manquant : {changes}

source: Required by currently deployed change: {changes}
fr: Requis par le changement actuellement déployé : {changes}

source: Plan file {file} does not exist
fr: Le fichier de plan {file} n'existe pas

source: Plan file {file} is not a regular file
fr: Le fichier de plan {file} n'est pas un fichier régulier

source: Cannot open {file}: {error}
fr: Impossible d'ouvrir {file} : {error}

source: Syntax error in {file} at line {lineno}: {error}
fr: Erreur de syntaxe dans {file} à la ligne {lineno} : {error}

source: Invalid pragma; a blank line must come between pragmas and changes
fr: Pragma invalide; une ligne vide doit s'intercaler entre les pragmas et les changements

source: invalid project name "{project}": project names must not begin with punctuation, contain "@", ":", or "#", or end in punctuation or digits following punctuation
fr: nom de projet invalide "{project}" : les noms de projets ne doivent pas commencer par de la ponctuation, contenir "@", ":", ou "#", ou se terminer par de la ponctuation ou des chiffres après de la ponctuation

source: Missing %project pragma in {file}
fr: Pragma %project absent dans {file}

source: Invalid name; names must not begin with punctuation, contain "@", ":", or "#", or end in punctuation or digits following punctuation
fr: Nom invalide; les noms ne doivent pas commencer par de la ponctuation, contenir "@", ":", ou "#", ou se terminer par de la ponctuation ou des chiffres après de la ponctuation

source: Missing timestamp and planner name and email
fr: Horodatage, nom et email du plannificateur absents

source: Missing timestamp
fr: Horodatage absent

source: Missing planner name and email
fr: Nom et email du plannificateur absents

source: "{name}" is a reserved name
fr: "{name}" est un nom réservé

source: "{name}" is invalid because it could be confused with a SHA1 ID
fr: "{name}" est invalide car il pourrait être confondu avec un ID SHA1

source: Tag "{tag}" declared without a preceding change
fr: Étiquette "{tag}" déclarée sans changement préalable

source: Tag "{tag}" duplicates earlier declaration on line {line}
fr: Étiquette "{tag}" duplique une déclaration précédente à la ligne {line}

source: Tags may not specify dependencies
fr: Les étiquettes ne peuvent pas spécifier les dépendances

source: Change "{change}" duplicates earlier declaration on line {line}
fr: Le changement "{change}" duplique une déclaration précédente à la ligne {line}

source: "{dep}" is not a valid dependency specification
fr: "{dep}" n'est pas une spécification de dépendance valide

source: Unknown change "{required}" required by change "{change}"
fr: Changement "{required}" inconnu requis par le changemet "{change}"

source: Cannot find change "{change}" in plan
fr: Impossible de trouver le changement "{change}" dans le plan

source: Tag "{tag}" already exists
fr: L'étiquette "{tag}" existe déjà

source: Cannot apply tag "{tag}" to a plan with no changes
fr: Impossible d'appliquer l'étiquette "{tag}" à un plan sans changement

source: Change "{change}" already exists. Use "sqitch rework" to copy and rework it
fr: Changement "{change}" déjà existant. Utiliser "sqitch rework" pour le copier et le retravailler

source: Change "{change}" does not exist. Use "sqitch add {change}" to add it to the plan
fr: Le changement "{change}" n'existe pas. Utiliser "sqitch add {change}" pour l'ajouter au plan

source: Cannot rework "{change}" without an intervening tag. Use "sqitch tag" to create a tag and try again
fr: Retravail de "{change}" impossible sans un tag d'intervention. Utiliser "sqitch tag" pour créer un tag et recommencer

source: Cannot add change "{change}": requires unknown change "{req}"
fr: Impossible d'ajouter le changement "{change}" : il requiert un changement inconnu "{req}"

source: Cannot rework change "{change}": requires unknown change "{req}"
fr: Impossible de retravailler le changement "{change}" : il requiert un changement inconnu "{req}"

source: "{name}" is invalid: changes must not begin with punctuation, contain "@", ":", or "#", or end in punctuation or digits following punctuation
fr: "{name}" est invalide : les changements ne doivent pas commencer par de la ponctuation, contenir "@", ":", ou "#", ou se terminer par de la ponctuation ou des chiffres après de la ponctuation

source: "{name}" is invalid: tags must not begin with punctuation, contain "@", ":", or "#", or end in punctuation or digits following punctuation
fr: "{name}" est invalide : les étiquettes ne doivent pas commencer par de la ponctuation, contenir "@", ":", ou "#", ou se terminer par de la ponctuation ou des chiffres après de la ponctuation

source: Cannot find change {change}
fr: Impossible de trouver le changement {change}

source: "Error closing {file}: {error}
fr: "Erreur à la fermeture de {file} : {error}

source: Cannot find {script} template
fr: Impossible de trouver le patron {script}

source: add
fr: ajouter

source: Added "{change}" to {file}
fr: Ajouté "{change}" à {file}

source: Skipped {file}: already exists
fr: Ignoré {file}: existe déjà

source: Error creating {path}: {error}
fr: Erreur à la création de {path} : {error}

source: Error closing {file}: {error}
fr: Erreur à la fermeture de {file} : {error}

source: Created {file}
fr: {file} crée

source: Bundling into {dir}
fr: Groupement dans {dir}

source: Cannot copy {file}: does not exist
fr: Impossible de copier {file} : il n'existe pas

source: Copying {source} -> {dest}
fr: Copie {source} -> {dest}

source: Cannot copy "{source}" to "{dest}": {error}
fr: Impossible de copier "{source}" vers "{dest}" : {error}

source: Writing config
fr: Écriture de la configuration

source: Writing plan
fr: Écriture du plan

source: Writing plan from {from} to {to}
fr: Écriture du plan de {from} à {to}

source: Writing scripts
fr: Écriture des scripts

source: Unknown config action: {action}
fr: Action de configuration inconnue : {action}

source: More then one value for the key "{key}"
fr: Plus d'une valuer pour la clé : "{key}"

source: Cannot overwrite multiple values with a single value
fr: Impossible d'écraser plusieurs valeurs avec une seule valeur

source: Cannot unset key with multiple values
fr: Impossible d'effacer une clé avec plusieurs valeurs

source: No such section!
fr: Section inexistante !

source: No manual entry for {command}
fr: Pas d'entrée dans le manuel pour {command}

source: invalid project name "{project}": project names must not begin with punctuation, contain "@" or ":", or end in punctuation or digits following punctuation
fr: nom de projet invalide "{project}" : les noms de projets ne doivent pas commencer par de la ponctuation, contenir "@" ou ":", ou se terminer par de la ponctuation ou des chiffres après de la ponctuation

source: Deploy
fr: Déploiement

source: Revert
fr: Annulation

source: Fail
fr: Echec

source: deploy
fr: déploiement

source: revert
fr: annulation

source: fail
fr: échec

source: Event:
fr: Evènement :

source: Change:
fr: Changement :

source: Planner:
fr: Plannificateur :

source: By:
fr: Par :

source: Committed:
fr: Committé :

source: Planned:
fr: Prévu :

source: Name:
fr: Nom :

source: Project:
fr: Projet :

source: Requires:
fr: Requis :

source: Conflicts:
fr: Conflits :

source: No label passed to the _ format
fr: Pas d'étiquette passée au format _

source: Unknown label "{label}" passed to the _ format
fr: Étiquette "{label}" inconnue passée au format _

source: {color} is not a valid ANSI color
fr: {color} n'est pas une couleur ANSI valide

source: {attr} is not a valid change attribute
fr: {attr} n'est pas un changement d'attribut valide

source: Unknown log format "{format}"
fr: Format de journalisation "{format}" inconnu

source: Option "color" expects "always", "auto", or "never"
fr: L'option "color" attend "always", "auto", ou "never"

source: Database {db} has not been initilized for Sqitch
fr: La Base de Données {db} n'a pas été initialisée pour Sqitch

source: No events logged to {db}
fr: Pas d'évènements enregistrés dans {db}

source: Unknown log format code "{code}"
fr: Code de format de journalisation "{code}" inconnu

source: On database {db}
fr: Sur la Base de Données {db}

source: rework
fr: retravail

source: Added "{change}" to {file}.
fr: Ajouté "{change}" à {file}

source: Modify this file as appropriate:
fr: Modification de ce fichier comme il convient

source: Skipped {dest}: {src} does not exist
fr: {dest} ignoré : {src} n'existe pas

source: Cannot copy {src} to {dest}: {error}
fr: Impossible de copier {src} vers {dest} : {error}

source: Copied {src} to {dest}
fr: {src} copié vers {dest}

source: Database not initialized for Sqitch
fr: Base de Données pas initialisée pour Sqitch

source: No projects registered
fr: Pas de projets enregistrés

source: Use --project to select which project to query: {projects}
fr: Utiliser --project pour sélectionner le projet à interroger : {projects}

source: No changes deployed
fr: Pas de changements déployés

source: Status unknown. Use --plan-file to assess "{project}" status
fr: Statut inconnu. Utiliser --plan-file pour évaluer le statut de "{project}"

source: Project: {project}
fr: Projet : {project}

source: Change: {change_id}
fr: Changement : {change_id}

source: Name: {change}
fr: Nom : {change}

source: Tag: {tags}
fr: Étiquette : {tags}

source: Deployed: {date}
fr: Déployé : {date}

source: By: {name} <{email}>
fr: Par : {name} <{email}>

source: Change:
fr: Changement :

source: Tags: None.
fr: Étiquettes : Aucune

source: Tag:
fr: Étiquette :

source: Cannot find this change in {file}
fr: Impossible de trouver ce changement dans {file}

source: Make sure you are connected to the proper database for this project.
fr: Assurez-vous d'être connecté à la bonne base de données pour ce projet

source: Undeployed change:
fr: Changement non déployé :

source: tag
fr: étiquette

source: Tagged "{change}" with {tag}
fr: "{change}" étiquetté avec {tag}

source: DBD::Pg module required to manage PostgreSQL
fr: Module DBD::Pg requis pour gérer PostgreSQL

source: Sqitch schema "{schema}" already exists
fr: Le schéma Sqitch "{schema}" existe déjà

source: Cannot register "{project}" with URI {uri}: already exists with NULL URI
fr: Impossible d'enregistrer "{project}" avec l'URI {uri} : il existe déjà avec un URI NULL

source: Cannot register "{project}" without URI: already exists with URI {uri}
fr: Impossible d'enregistrer "{project}" sans URI : il existe déjà avec l'URI {uri}

source: Cannot register "{project}" with URI {uri}: already exists with URI {reg_uri}
fr: Impossible d'enregistrer "{project}" avec l'URI {uri} : il existe déjà avec l'URI {reg_uri}

source: Cannot register "{project}" with URI {uri}: project "{reg_prog}" already using that URI
fr: Impossible d'enregistrer "{project}" avec l'URI {uri} : le projet "{reg_prog}" utilise déjà cet URI

source: Please enter a note for your change. Lines starting with '#' will be ignored, and an empty message aborts the {command}.
fr: Merci de saisir une note pour votre changement. Les lignes commençant par '#' seront ignorées, et un message vide annulera le {command}.

source: Change to {command}:
fr: Changement à {command}

source: Unknown tag "{tag}"
fr: Étiquette inconnue "{tag}"

source: Key {key} at multiple indexes
fr: Clé {key} indexée plusieurs fois

source: Unknown change: "{change}"
fr: Changement inconnu "{change}"

source: Unable to find change "{change}" in plan {file}
fr: Incapable de trouver le changement "{change}" dans le plan {file}

source: Aborting due to empty note
fr: Abandon dû à une note vide

source: Write a {command} note. Lines starting with '#' will be ignored.
fr: Écrivez une note pour {command}. Les lignes commençant par '#' seront ignorées.
